<div class="alert alert-block alert-info">
    <h1>List of Queries</h1>
    <p>These queries are the solution to the corresponding SQL questions asked about the Olympics dataset from Kaggle.</p>
</div>

### Connect to SQLite Db

In [1]:
%load_ext sql

In [2]:
import csv, sqlite3

In [3]:
con = sqlite3.connect("athletes.db")
cur = con.cursor()

In [4]:
%sql sqlite:///athletes.db

### Commence querying

Explore column names of `athletes` table.

In [5]:
%%sql

PRAGMA table_info(athletes);

 * sqlite:///athletes.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 0),
 (1, 'Name', 'TEXT', 0, None, 0),
 (2, 'Sex', 'TEXT', 0, None, 0),
 (3, 'Age', 'REAL', 0, None, 0),
 (4, 'Height', 'REAL', 0, None, 0),
 (5, 'Weight', 'REAL', 0, None, 0),
 (6, 'Team', 'TEXT', 0, None, 0),
 (7, 'NOC', 'TEXT', 0, None, 0),
 (8, 'Games', 'TEXT', 0, None, 0),
 (9, 'Year', 'INTEGER', 0, None, 0),
 (10, 'Season', 'TEXT', 0, None, 0),
 (11, 'City', 'TEXT', 0, None, 0),
 (12, 'Sport', 'TEXT', 0, None, 0),
 (13, 'Event', 'TEXT', 0, None, 0),
 (14, 'Medal', 'TEXT', 0, None, 0)]

Return first few rows

In [6]:
%%sql

SELECT * FROM athletes LIMIT 3;

 * sqlite:///athletes.db
Done.

[(11592, 'Aranka Binder', 'F', 26.0, 163.0, 47.0, 'Individual Olympic Athletes', 'IOA', '1992 Summer', 1992, 'Summer', 'Barcelona', 'Shooting', "Shooting Women's Air Rifle, 10 metres", 'Bronze'),
 (26774, 'Frederik Albert De Waele', 'M', 33.0, None, None, 'Belgium', 'BEL', '1952 Summer', 1952, 'Summer', 'Helsinki', 'Gymnastics', "Gymnastics Men's Parallel Bars", None),
 (132574, 'Yang Yun', 'F', 15.0, 158.0, 40.0, 'China', 'CHN', '2000 Summer', 2000, 'Summer', 'Sydney', 'Gymnastics', "Gymnastics Women's Individual All-Around", None)]

1. Fetch the top 5 athletes who have won the most gold medals.

In [7]:
%%sql

SELECT Name, COUNT(*) AS Gold_medal
FROM athletes
WHERE Medal = 'Gold'
GROUP BY Name
ORDER BY Gold_medal DESC
LIMIT 5;

 * sqlite:///athletes.db
Done.

[('smet Atl', 1),
 ('Zhang Guozheng', 1),
 ('Yoshikatsu Yoshida', 1),
 ('Yelena Aleksandrovna Grudneva', 1),
 ('Wladimir Reznitschenko', 1)]

2. Fetch the top 5 most successful countries in olympics. Success is defined by no of medals won.

In [8]:
%%sql

SELECT Team, COUNT(Medal) AS Number_of_medals
FROM athletes
WHERE Medal <> 'None'
GROUP BY Team
ORDER BY Number_of_medals DESC
LIMIT 5;

 * sqlite:///athletes.db
Done.

[('United States', 31),
 ('Germany', 19),
 ('France', 18),
 ('Soviet Union', 17),
 ('Italy', 15)]

3. List down total gold medals won by each country.

In [9]:
%%sql

SELECT Team, COUNT(Medal) AS Gold_medals
FROM athletes
WHERE Medal = 'Gold'
GROUP BY Team;

 * sqlite:///athletes.db
Done.

[('Australia', 3),
 ('Azerbaijan', 1),
 ('Barrenjoey', 1),
 ('Belgium', 2),
 ('Brazil', 3),
 ('Brazil-1', 1),
 ('Canada', 3),
 ('China', 1),
 ('Cuba', 2),
 ('Czech Republic', 1),
 ('Czechoslovakia', 2),
 ('Denmark', 2),
 ('East Germany', 1),
 ('England-1', 1),
 ('Finland', 2),
 ('France', 5),
 ('Germany', 4),
 ('Germany-1', 1),
 ('Great Britain', 4),
 ('Hungary', 3),
 ('India', 1),
 ('Italy', 5),
 ('Japan', 3),
 ('Kenya', 1),
 ('Llanoria', 1),
 ('Netherlands', 3),
 ('New Zealand', 1),
 ('Nigeria', 1),
 ('Norway', 4),
 ('Poland', 1),
 ('Romania', 1),
 ('Russia', 5),
 ('South Korea', 4),
 ('Soviet Union', 6),
 ('Spain', 2),
 ('Sweden', 5),
 ('Switzerland', 2),
 ('Switzerland-1', 1),
 ('Turkey', 1),
 ('Unified Team', 1),
 ('United States', 7),
 ('United States-1', 2),
 ('West Germany', 1),
 ('White Lady', 1),
 ('Zimbabwe', 1)]

4. Identify which country won the most bronze medals.

In [ ]:
%%sql

SELECT Team, COUNT(Medal) AS Bronze_medals
FROM athletes
WHERE Medal = 'Bronze'
GROUP BY Team
ORDER BY Bronze_medals DESC
LIMIT 1;

5. In which Sport/event, United States has won highest medals?

In [ ]:
%%sql

SELECT Sport, COUNT(Medal) AS Medals
FROM athletes
WHERE Team = 'United States' AND Medal <> 'None'
GROUP BY Sport
ORDER BY Medals DESC
LIMIT 1;

6. Break down all olympic games where United States won medals for and how many medals where won in each olympic games.

In [ ]:
%%sql

SELECT Games, COUNT(Medal) AS Num_of_medals
FROM athletes
WHERE Team = 'United States' AND Medal <> 'None'
GROUP BY Games;